# control flow แบ่งเป็น 2 กลุ่ม / conrol statment แยกเป็น 2 กลุ่มเช่นกัน
# 1. selection/Decision เลือกทำ คือ ต้องพิสูจน์ตรวจสอบก่อนทำงานใดๆ แยกเป็น3แบบย่อย
# - พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จไม่ทำ  (if)
# - พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จก็ทำ (if-else)
# - พิสูจน์ตรวจสอบหลายครั้ง              (if-elif-else)

#2. loob/Iteration/Repetion ทำซ้ำ คือ ทำงานเดม ซ้ำๆ แยกเป็น 2 แบบ
# - รู้จำนวนครั้งในการทำซ้ำ
# -ไม่รู้จำนวนครั้งในการทำซ้ำ
# - while, for
# ***สิ่งที่ต้องระวังในการทำซ้ำ คือ ต้องรู้จบ

# ***statement ที่เกี่ยวกับ Conrol flow คือ break, continue โดยเฉพาะ Loop