#โปรแกรมตรวจสอบน้ำหนักรถบรรทุก ว่ารถบรรทุกนั้นมีน้ำหนักรถผ่านเกณฑ์หรือไม่ หากน้ำหนักเกิน 1000 ให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถไม่ผ่านเกณฑ์"  แต่หากน้ำหนักตั้งแต่ 1000 ลงมาให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถผ่านเกณฑ์" โดยให้ป้อนทะเบียนรถบรรทุก และน้ำหนักรถบรรทุกทางแป้นพิม
print('--------------------------')
print('โปรแกรมตรวจสอบน้ำหนักรถบรรทุก')
print('--------------------------')

# รับค่าข้อมูลจากผู้ใช้
plate = input('ป้อนทะเบียนรถบรรทุก : ')
weight = float(input('ป้อนน้ำหนักรถบรรทุก (กก.) : '))

print('--------------------------')

# ตรวจสอบเงื่อนไขด้วย if else
if weight > 1000:
    print(f'รถทะเบียน {plate} น้ำหนักรถไม่ผ่านเกณฑ์')
else:
    print(f'รถทะเบียน {plate} น้ำหนักรถผ่านเกณฑ์')

print('--------------------------')
